levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ermu.c
/**
 *******************************************************************************
 * @file  hc32_ll_ermu.c
 * @brief This file provides firmware functions to manage the Error Management
 *        Unit(ERMU).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-13       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2025, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_ermu.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_ERMU ERMU
 * @brief Error Management Unit
 * @{
 */

#if (LL_ERMU_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ERMU_Local_Macros ERMU Local Macros
 * @{
 */

#define ERMU_RMU_TIMEOUT                (100U)

#define ERMU_UNIT_REG(reg_base, unit)   (*(__IO uint32_t *)((uint32_t)(&(reg_base)) + ((unit) * 0x0080UL)))

#define ERMU_WTUNIT_REG(reg_base, unit) (*(__IO uint32_t *)((uint32_t)(&(reg_base)) + ((unit) * 0x0020UL)))

#define ERMU_GROUP_REG(reg_base, group) (*(__IO uint32_t *)((uint32_t)(&(reg_base)) + ((uint32_t)(group) * 0x04UL)))

/**
 * @defgroup ERMU_Check_Parameters_Validity ERMU Check Parameters Validity
 * @{
 */

#define IS_EOUT_UNIT(x)                                                         \
(   ((x) == ERMU_EOUT0)                 ||                                      \
    ((x) == ERMU_EOUT1)                 ||                                      \
    ((x) == ERMU_EOUT2)                 ||                                      \
    ((x) == ERMU_EOUT3))

#define IS_WTMR_UNIT(x)                                                         \
(   ((x) == ERMU_WTMR0)                 ||                                      \
    ((x) == ERMU_WTMR1)                 ||                                      \
    ((x) == ERMU_WTMR2)                 ||                                      \
    ((x) == ERMU_WTMR3))

#define IS_ERR_GROUP(x)                 (((x) == ERMU_ERR_GRP0) || ((x) == ERMU_ERR_GRP1))

#define IS_EOUT_MASK_GRP0(x)            (((x) | (ERMU_GRP0_ERR_ALL)) == (ERMU_GRP0_ERR_ALL))
#define IS_EOUT_MASK_GRP1(x)            (((x) | (ERMU_GRP1_ERR_ALL)) == (ERMU_GRP1_ERR_ALL))

#define IS_ERR_SRC_GRP0(x)              (((x) != 0UL) && (((x) | (ERMU_GRP0_ERR_ALL)) == (ERMU_GRP0_ERR_ALL)))
#define IS_ERR_SRC_GRP1(x)              (((x) != 0UL) && (((x) | (ERMU_GRP1_ERR_ALL)) == (ERMU_GRP1_ERR_ALL)))

#define IS_ERR_SRC_VALUE(group, src)    ((((group) == ERMU_ERR_GRP0) && IS_ERR_SRC_GRP0(src)) || \
                                        (((group) == ERMU_ERR_GRP1) && IS_ERR_SRC_GRP1(src)))

#define IS_CLK_DIV_VALUE(x)             (((x) > 0UL) && (x) <= 0x10000UL)

#define IS_TMR_CMP_VALUE(x)             ((x) <= 0xFFFFUL)

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ERMU_Global_Functions ERMU Global Functions
 * @{
 */

/**
 * @brief  Set the fields of structure stc_ermu_eout_t to default values
 * @param  [out] pstcEoutInit       Pointer to a @ref stc_ermu_eout_t structure
 * @retval int32_t:
 *           - LL_OK:               Initialize successfully
 *           - LL_ERR_INVD_PARAM:   The pointer pstcEoutInit value is NULL
 */
int32_t ERMU_EOUT_StructInit(stc_ermu_eout_t *pstcEoutInit)
{
    int32_t i32Ret = LL_ERR_INVD_PARAM;

    if (NULL != pstcEoutInit) {
        pstcEoutInit->enClearTmrEn = DISABLE;
        pstcEoutInit->u32ClearTmrCmpValue = 0UL;
        pstcEoutInit->enToggleTmrEn = DISABLE;
        pstcEoutInit->u32ToggleTmrCmpValue = 0UL;
        pstcEoutInit->u32EoutMaskGroup0 = 0UL;
        pstcEoutInit->u32EoutMaskGroup1 = 0UL;
        i32Ret = LL_OK;
    }

    return i32Ret;
}

/**
 * @brief  Initializes ERMU error output
 * @param  [in] pstcEoutInit    Pointer to a @ref stc_ermu_eout_t structure
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval int32_t:
 *           - LL_OK: Initializes success
 *           - LL_ERR_INVD_PARAM: pstcEoutInit == NULL
 */
int32_t ERMU_EOUT_Init(const stc_ermu_eout_t *pstcEoutInit, uint8_t u8Unit)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *RegAddr;

    if (NULL == pstcEoutInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_EOUT_UNIT(u8Unit));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcEoutInit->enClearTmrEn));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcEoutInit->enToggleTmrEn));
        DDL_ASSERT(IS_EOUT_MASK_GRP0(pstcEoutInit->u32EoutMaskGroup0));
        DDL_ASSERT(IS_EOUT_MASK_GRP1(pstcEoutInit->u32EoutMaskGroup1));
        /* Set Clear Timer */
        RegAddr = &ERMU_UNIT_REG(CM_ERMU->EO0CTCMP, u8Unit);
        MODIFY_REG32(*RegAddr, ERMU_EOCTCMP_CMP, (pstcEoutInit->u32ClearTmrCmpValue & 0xFFFFUL));
        RegAddr = &ERMU_UNIT_REG(CM_ERMU->EO0C, u8Unit);
        MODIFY_REG32(*RegAddr, ERMU_EOC_CTE, ((uint32_t)pstcEoutInit->enClearTmrEn << ERMU_EOC_CTE_POS));
        /* Set Toggle Timer */
        RegAddr = &ERMU_UNIT_REG(CM_ERMU->EO0TTCMP, u8Unit);
        MODIFY_REG32(*RegAddr, ERMU_EOTTCMP_CMP, (pstcEoutInit->u32ToggleTmrCmpValue & 0xFFFFUL));
        RegAddr = &ERMU_UNIT_REG(CM_ERMU->EO0TTC, u8Unit);
        MODIFY_REG32(*RegAddr, ERMU_EOTTC_TTE, pstcEoutInit->enToggleTmrEn);
        /* Set Error output Mask */
        RegAddr = &ERMU_UNIT_REG(CM_ERMU->EO0OM0, u8Unit);
        WRITE_REG32(*RegAddr, pstcEoutInit->u32EoutMaskGroup0);
        RegAddr = &ERMU_UNIT_REG(CM_ERMU->EO0OM1, u8Unit);
        WRITE_REG32(*RegAddr, pstcEoutInit->u32EoutMaskGroup1);
    }

    return i32Ret;
}

/**
 * @brief  Get ERMU error output error status
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval An @ref en_flag_status_t enumeration type value
 */
en_flag_status_t ERMU_EOUT_GetErrorStatus(uint8_t u8Unit)
{
    en_flag_status_t enFlagStatus = RESET;
    __IO uint32_t *EOxS;

