levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ermu.c
    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxS = &ERMU_UNIT_REG(CM_ERMU->EO0S, u8Unit);
    if (0UL != (READ_REG32_BIT(*EOxS, ERMU_EOS_EOS))) {
        enFlagStatus = SET;
    }

    return enFlagStatus;
}

/**
 * @brief  Clear ERMU error output error status
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval None
 * @note   Make sure that no unmasked errors occur and clear timer not enable
 */
void ERMU_EOUT_ClearErrorStatus(uint8_t u8Unit)
{
    __IO uint32_t *EOxC;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxC = &ERMU_UNIT_REG(CM_ERMU->EO0C, u8Unit);
    SET_REG32_BIT(*EOxC, ERMU_EOC_CLR);
}

/**
 * @brief  Set ERMU error output error status
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval None
 */
void ERMU_EOUT_SetErrorStatus(uint8_t u8Unit)
{
    __IO uint32_t *EOxC;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxC = &ERMU_UNIT_REG(CM_ERMU->EO0C, u8Unit);
    SET_REG32_BIT(*EOxC, ERMU_EOC_SET);
}

/**
 * @brief  Set the timer clock divider value
 * @param  [in] u32Div          Actual frequency division of the current timer
 *                              This parameter must be a value between 1~65536
 * @retval None
 */
void ERMU_SetClockDiv(uint32_t u32Div)
{
    DDL_ASSERT(IS_CLK_DIV_VALUE(u32Div));

    MODIFY_REG32(CM_ERMU->CCPS, ERMU_CCPS_PSS, (u32Div - 1U) << ERMU_CCPS_PSS_POS);
}

/**
 * @brief  Get the timer clock divider value
 * @param  None
 * @retval uint32_t             Actual frequency division of the current timer
 */
uint32_t ERMU_GetClockDiv(void)
{
    return ((READ_REG32_BIT(CM_ERMU->CCPS, ERMU_CCPS_PSS) >> ERMU_CCPS_PSS_POS) + 1U);
}

/**
 * @brief  Enable/Disable clock divider
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_ClockDivCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ERMU->CCPS_b.PSE, enNewState);
}

/**
 * @brief  Enable/Disable clear timer
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_CTMR_Cmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *EOxC;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    EOxC = &ERMU_UNIT_REG(CM_ERMU->EO0C, u8Unit);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*EOxC, ERMU_EOC_CTE);
    } else {
        CLR_REG32_BIT(*EOxC, ERMU_EOC_CTE);
    }
}

/**
 * @brief  Get ERMU clear timer status
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval An @ref en_flag_status_t enumeration type value
 */
en_flag_status_t ERMU_CTMR_GetStatus(uint8_t u8Unit)
{
    en_flag_status_t enFlagStatus = RESET;
    __IO uint32_t *EOxS;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxS = &ERMU_UNIT_REG(CM_ERMU->EO0S, u8Unit);
    if (0UL != (READ_REG32_BIT(*EOxS, ERMU_EOS_CTS))) {
        enFlagStatus = SET;
    }

    return enFlagStatus;
}

/**
 * @brief  Get clear timer counter value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval uint16_t             The counter register value
 */
uint16_t ERMU_CTMR_GetCountValue(uint8_t u8Unit)
{
    __IO uint32_t *EOxCTCNT;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxCTCNT = &ERMU_UNIT_REG(CM_ERMU->EO0CTCNT, u8Unit);

    return (uint16_t)READ_REG32(*EOxCTCNT);
}

/**
 * @brief  Get clear timer compare value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval uint16_t             The compare register value
 */
uint16_t ERMU_CTMR_GetCompareValue(uint8_t u8Unit)
{
    __IO uint32_t *EOxCTCMP;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxCTCMP = &ERMU_UNIT_REG(CM_ERMU->EO0CTCMP, u8Unit);

    return (uint16_t)READ_REG32(*EOxCTCMP);
}

/**
 * @brief  Set clear timer compare value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @param  [in] u32Value        Compare Value of the timer
 *                              This parameter must be a value between 0~65535
 * @retval None
 */
void ERMU_CTMR_SetCompareValue(uint8_t u8Unit, uint32_t u32Value)
{
    __IO uint32_t *EOxCTCMP;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));
    DDL_ASSERT(IS_TMR_CMP_VALUE(u32Value));

    EOxCTCMP = &ERMU_UNIT_REG(CM_ERMU->EO0CTCMP, u8Unit);
    MODIFY_REG32(*EOxCTCMP, ERMU_EOCTCMP_CMP, u32Value);
}

/**
 * @brief  Enable/Disable toggle timer
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_TTMR_Cmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *EOxTTC;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    EOxTTC = &ERMU_UNIT_REG(CM_ERMU->EO0TTC, u8Unit);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*EOxTTC, ERMU_EOTTC_TTE);
    } else {
        CLR_REG32_BIT(*EOxTTC, ERMU_EOTTC_TTE);
    }
}

/**
 * @brief  Get toggle timer compare value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @retval uint16_t             The compare register value
 */
uint16_t ERMU_TTMR_GetCompareValue(uint8_t u8Unit)
{
    __IO uint32_t *EOxTTCMP;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));

    EOxTTCMP = &ERMU_UNIT_REG(CM_ERMU->EO0TTCMP, u8Unit);

    return (uint16_t)READ_REG32(*EOxTTCMP);
}

/**
 * @brief  Set toggle timer compare value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Eout_Unit
 * @param  [in] u32Value        Compare Value of the timer
 *                              This parameter must be a value between 0~65535
 * @retval None
 */
void ERMU_TTMR_SetCompareValue(uint8_t u8Unit, uint32_t u32Value)
{
    __IO uint32_t *EOxTTCMP;

    DDL_ASSERT(IS_EOUT_UNIT(u8Unit));
    DDL_ASSERT(IS_TMR_CMP_VALUE(u32Value));

    EOxTTCMP = &ERMU_UNIT_REG(CM_ERMU->EO0TTCMP, u8Unit);
    MODIFY_REG32(*EOxTTCMP, ERMU_EOTTCMP_CMP, u32Value);
}

/**
 * @brief  Enable/Disable wait timer
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_WTMR_Cmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *WTxC;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WTxC = &ERMU_WTUNIT_REG(CM_ERMU->WT0C, u8Unit);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*WTxC, ERMU_WTC_WTE);
    } else {
        CLR_REG32_BIT(*WTxC, ERMU_WTC_WTE);
    }
}

/**
 * @brief  Enable/Disable the high priority interrupt boot wait timer function
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_WTMR_HighPriorityIntBootCmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *WTxSE;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WTxSE = &ERMU_WTUNIT_REG(CM_ERMU->WT0SE, u8Unit);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*WTxSE, ERMU_WTSE_HPISE);
    } else {
        CLR_REG32_BIT(*WTxSE, ERMU_WTSE_HPISE);
    }
}

/**
 * @brief  Enable/Disable the low priority interrupt boot wait timer function
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_WTMR_LowPriorityIntBootCmd(uint8_t u8Unit, en_functional_state_t enNewState)
{
    __IO uint32_t *WTxSE;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WTxSE = &ERMU_WTUNIT_REG(CM_ERMU->WT0SE, u8Unit);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*WTxSE, ERMU_WTSE_LPISE);
    } else {
        CLR_REG32_BIT(*WTxSE, ERMU_WTSE_LPISE);
    }
}

/**
 * @brief  Stop wait timer
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @retval None
 */
void ERMU_WTMR_Stop(uint8_t u8Unit)
{
    __IO uint32_t *WTxC;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));

    WTxC = &ERMU_WTUNIT_REG(CM_ERMU->WT0C, u8Unit);
    SET_REG32_BIT(*WTxC, ERMU_WTC_STP);
}

/**
 * @brief  Get ERMU wait timer status
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @retval An @ref en_flag_status_t enumeration type value
 */
en_flag_status_t ERMU_WTMR_GetStatus(uint8_t u8Unit)
{
    en_flag_status_t enFlagStatus = RESET;
    __IO uint32_t *WTxS;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));

    WTxS = &ERMU_WTUNIT_REG(CM_ERMU->WT0S, u8Unit);
    if (0UL != (READ_REG32_BIT(*WTxS, ERMU_WTS_WTS))) {
        enFlagStatus = SET;
    }

    return enFlagStatus;
}

/**
 * @brief  Get wait timer counter value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @retval uint16_t             The counter register value
 */
uint16_t ERMU_WTMR_GetCountValue(uint8_t u8Unit)
{
    __IO uint32_t *WTxCNT;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));

