levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ermu.c
    WTxCNT = &ERMU_WTUNIT_REG(CM_ERMU->WT0CNT, u8Unit);

    return (uint16_t)READ_REG32(*WTxCNT);
}

/**
 * @brief  Get wait timer compare value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @retval uint16_t             The compare register value
 */
uint16_t ERMU_WTMR_GetCompareValue(uint8_t u8Unit)
{
    __IO uint32_t *WTxCMP;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));

    WTxCMP = &ERMU_WTUNIT_REG(CM_ERMU->WT0CMP, u8Unit);

    return (uint16_t)READ_REG32(*WTxCMP);
}

/**
 * @brief  Set wait timer compare value
 * @param  [in] u8Unit          Error output unit @ref ERMU_Wtmr_Unit
 * @param  [in] u32Value        Compare Value of the timer
 *                              This parameter must be a value between 0~65535
 * @retval None
 */
void ERMU_WTMR_SetCompareValue(uint8_t u8Unit, uint32_t u32Value)
{
    __IO uint32_t *WTxCMP;

    DDL_ASSERT(IS_WTMR_UNIT(u8Unit));
    DDL_ASSERT(IS_TMR_CMP_VALUE(u32Value));

    WTxCMP = &ERMU_WTUNIT_REG(CM_ERMU->WT0CMP, u8Unit);
    MODIFY_REG32(*WTxCMP, ERMU_WTCMP_CMP, u32Value);
}

/**
 * @brief  Get the specified error source status
 * @param  [in] u8Group         Error group @ref ERMU_Error_Group
 * @param  [in] u32ErrSrc       Error source selection
 *                              When u8Group is ERMU_ERR_GRP0, this parameter can be any combination of @ref ERMU_Error_Src_Group0
 *                              When u8Group is ERMU_ERR_GRP1, this parameter can be any combination of @ref ERMU_Error_Src_Group1
 * @retval An @ref en_flag_status_t enumeration type value
 */
en_flag_status_t ERMU_GetErrorSrcStatus(uint8_t u8Group, uint32_t u32ErrSrc)
{
    en_flag_status_t enStatus = RESET;
    __IO uint32_t *ESSx;

    DDL_ASSERT(IS_ERR_GROUP(u8Group));
    DDL_ASSERT(IS_ERR_SRC_VALUE(u8Group, u32ErrSrc));

    ESSx = &ERMU_GROUP_REG(CM_ERMU->ESS0, u8Group);
    if (0UL != READ_REG32_BIT(*ESSx, u32ErrSrc)) {
        enStatus = SET;
    }

    return enStatus;
}

/**
 * @brief  Clear the specified error source status
 * @param  [in] u8Group         Error group @ref ERMU_Error_Group
 * @param  [in] u32ErrSrc       Error source selection
 *                              When u8Group is ERMU_ERR_GRP0, this parameter can be any combination of @ref ERMU_Error_Src_Group0
 *                              When u8Group is ERMU_ERR_GRP1, this parameter can be any combination of @ref ERMU_Error_Src_Group1
 * @retval None
 */
void ERMU_ClearErrorSrcStatus(uint8_t u8Group, uint32_t u32ErrSrc)
{
    __IO uint32_t *ESSCx;

    DDL_ASSERT(IS_ERR_GROUP(u8Group));
    DDL_ASSERT(IS_ERR_SRC_VALUE(u8Group, u32ErrSrc));

    ESSCx = &ERMU_GROUP_REG(CM_ERMU->ESSC0, u8Group);
    WRITE_REG32(*ESSCx, u32ErrSrc);
}

/**
 * @brief  Set pseudo error trigger
 * @param  [in] u8Group         Error group @ref ERMU_Error_Group
 * @param  [in] u32ErrSrc       Error source selection
 *                              When u8Group is ERMU_ERR_GRP0, this parameter can be any combination of @ref ERMU_Error_Src_Group0
 *                              When u8Group is ERMU_ERR_GRP1, this parameter can be any combination of @ref ERMU_Error_Src_Group1
 * @retval None
 */
void ERMU_SetPseudoErrorTrigger(uint8_t u8Group, uint32_t u32ErrSrc)
{
    __IO uint32_t *PETx;

    DDL_ASSERT(IS_ERR_GROUP(u8Group));
    DDL_ASSERT(IS_ERR_SRC_VALUE(u8Group, u32ErrSrc));

    PETx = &ERMU_GROUP_REG(CM_ERMU->PET0, u8Group);
    WRITE_REG32(*PETx, u32ErrSrc);
}

/**
 * @brief  Enable/Disable error reset system function
 * @param  [in] u8Group         Error group @ref ERMU_Error_Group
 * @param  [in] u32ErrSrc       Error source selection
 *                              When u8Group is ERMU_ERR_GRP0, this parameter can be any combination of @ref ERMU_Error_Src_Group0
 *                              When u8Group is ERMU_ERR_GRP1, this parameter can be any combination of @ref ERMU_Error_Src_Group1
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_ResetCmd(uint8_t u8Group, uint32_t u32ErrSrc, en_functional_state_t enNewState)
{
    __IO uint32_t *REx;

    DDL_ASSERT(IS_ERR_GROUP(u8Group));
    DDL_ASSERT(IS_ERR_SRC_VALUE(u8Group, u32ErrSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    REx = &ERMU_GROUP_REG(CM_ERMU->RE0, u8Group);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*REx, u32ErrSrc);
    } else {
        CLR_REG32_BIT(*REx, u32ErrSrc);
    }
}

/**
 * @brief  Enable/Disable low priority error interrupt
 * @param  [in] u8Group         Error group @ref ERMU_Error_Group
 * @param  [in] u32ErrSrc       Error source selection
 *                              When u8Group is ERMU_ERR_GRP0, this parameter can be any combination of @ref ERMU_Error_Src_Group0
 *                              When u8Group is ERMU_ERR_GRP1, this parameter can be any combination of @ref ERMU_Error_Src_Group1
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_LowPriorityIntCmd(uint8_t u8Group, uint32_t u32ErrSrc, en_functional_state_t enNewState)
{
    __IO uint32_t *LPIEx;

    DDL_ASSERT(IS_ERR_GROUP(u8Group));
    DDL_ASSERT(IS_ERR_SRC_VALUE(u8Group, u32ErrSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    LPIEx = &ERMU_GROUP_REG(CM_ERMU->LPIE0, u8Group);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*LPIEx, u32ErrSrc);
    } else {
        CLR_REG32_BIT(*LPIEx, u32ErrSrc);
    }
}

/**
 * @brief  Enable/Disable high priority(NMI) error interrupt
 * @param  [in] u8Group         Error group @ref ERMU_Error_Group
 * @param  [in] u32ErrSrc       Error source selection
 *                              When u8Group is ERMU_ERR_GRP0, this parameter can be any combination of @ref ERMU_Error_Src_Group0
 *                              When u8Group is ERMU_ERR_GRP1, this parameter can be any combination of @ref ERMU_Error_Src_Group1
 * @param  [in] enNewState      An @ref en_functional_state_t enumeration value
 * @retval None
 */
void ERMU_HighPriorityIntCmd(uint8_t u8Group, uint32_t u32ErrSrc, en_functional_state_t enNewState)
{
    __IO uint32_t *HPIEx;

    DDL_ASSERT(IS_ERR_GROUP(u8Group));
    DDL_ASSERT(IS_ERR_SRC_VALUE(u8Group, u32ErrSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    HPIEx = &ERMU_GROUP_REG(CM_ERMU->HPIE0, u8Group);
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*HPIEx, u32ErrSrc);
    } else {
        CLR_REG32_BIT(*HPIEx, u32ErrSrc);
    }
}

/**
 * @brief  De-Initialize ERMU function
 * @param  None
 * @retval int32_t:
 *         - LL_OK:           Reset success
 *         - LL_ERR_TIMEOUT:  Reset time out
 * @note   Call LL_PERIPH_WE(LL_PERIPH_PWC_CLK_RMU) unlock RMU_FRSTx register first
 */
int32_t ERMU_DeInit(void)
{
    int32_t i32Ret = LL_OK;
    __IO uint8_t u8TimeOut = 0U;

    DDL_ASSERT((CM_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1);
    CLR_REG32(bCM_RMU->FRST0_b.ERMU);
    /* Ensure reset procedure is completed */
    while (1UL != READ_REG32(bCM_RMU->FRST0_b.ERMU)) {
        u8TimeOut++;
        if (u8TimeOut > ERMU_RMU_TIMEOUT) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
    }

    return i32Ret;
}

/**
 * @}
 */

#endif /* LL_ERMU_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
